Documents/ДокументУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ДокументУТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыПоАктам</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.Реализация</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовУТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоммерческоеВознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСмете</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СметаЗадачиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СметаЗадачиПроекта</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конвертирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключитьВСмету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененоДокументом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ФондПодразделений</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеОплата</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспеченоПоСтатье</xr:Item>
				<xr:Item>AccumulationRegister.ВознаграждениеПосредника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходыВс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВознагрПосредника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыВознПосредника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыППЛО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыКоммерческие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОТ_ПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АктыВыполненныхРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ДокументУТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАкта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспеченоРанее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДокументУТ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// 
&НаСервере
Процедура ЗаполнитьКоммерческиеРасходыПоЗадачам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА СметаЗадачиПроектаРасчет.Статья = &СтДоходыВс
		|				ТОГДА СметаЗадачиПроектаРасчет.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходПоСмете,
		|	СУММА(ВЫБОР
		|			КОГДА СметаЗадачиПроектаРасчет.Статья = &СтКоммРасходы
		|				ТОГДА СметаЗадачиПроектаРасчет.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоммРасходыПоСмете,
		|	СметаЗадачиПроектаРасчет.Ссылка.ЗадачаПроекта
		|ИЗ
		|	Документ.СметаЗадачиПроекта.Расчет КАК СметаЗадачиПроектаРасчет
		|ГДЕ
		|	СметаЗадачиПроектаРасчет.Ссылка.Проведен
		|	И СметаЗадачиПроектаРасчет.Ссылка.ЗадачаПроекта В(&ЗадачиПроекта)
		|
		|СГРУППИРОВАТЬ ПО
		|	СметаЗадачиПроектаРасчет.Ссылка.ЗадачаПроекта";

		
	// 
	мЗадач = Объект.КоммерческоеВознаграждение.Выгрузить().ВыгрузитьКолонку("ЗадачаПроекта");
	Запрос.УстановитьПараметр("ЗадачиПроекта", 	мЗадач);
	Запрос.УстановитьПараметр("СтДоходыВс", 	Справочники.СтатьиСметы.ДохФинансовые);
	Если Объект.Дата < Дата( 2014, 1, 1) Тогда
		Запрос.УстановитьПараметр("СтКоммРасходы", 	Справочники.СтатьиСметы.РасходыКоммерческие );
	Иначе
		Запрос.УстановитьПараметр("СтКоммРасходы", 	Справочники.СтатьиСметы.ВознаграждениеКМ );
	КонецЕсли;

	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ Объект.КоммерческоеВознаграждение Цикл
		СтрРез = Результат.Найти( Стр.ЗадачаПроекта, "ЗадачаПроекта");
		Если СтрРез = Неопределено Тогда
			Стр.СуммаПоСмете = 0;
		Иначе
			Стр.СуммаПоСмете = Стр.СуммаОбеспечено * СтрРез.КоммРасходыПоСмете / СтрРез.ДоходПоСмете;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисленоРанее_НаСервере()
    СуммаОплачено 	= 0;
	СуммаАктов		= 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(КоммерческоеВознаграждение.СуммаВознаграждения) КАК СуммаНачислено,
		|	СУММА(КоммерческоеВознаграждение.Сумма) КАК СуммаАктов,
		|	КоммерческоеВознаграждение.ЗадачаПроекта
		|ИЗ
		|	Документ.ДокументУТ.КоммерческоеВознаграждение КАК КоммерческоеВознаграждение
		|ГДЕ
		|	КоммерческоеВознаграждение.Ссылка.Договор = &Договор
		|	И КоммерческоеВознаграждение.Ссылка.Ссылка <> &Ссылка
		|	И КоммерческоеВознаграждение.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	КоммерческоеВознаграждение.ЗадачаПроекта";

	//
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Запрос.УстановитьПараметр("Ссылка",  Объект.Ссылка);

	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрО ИЗ Объект.КоммерческоеВознаграждение Цикл
		СтрР = Результат.Найти( СтрО.ЗадачаПроекта, "ЗадачаПроекта");
		Если СтрР = Неопределено Тогда 
			Продолжить; 
		КонецЕсли;
		СтрО.СуммаНачислено 	= СтрР.СуммаНачислено;
		СтрО.СуммаАктов 		= СтрР.СуммаАктов;
		
		СуммаНачислено 			= СуммаНачислено + СтрО.СуммаНачислено;
		СуммаАктов 				= СуммаАктов + СтрО.СуммаАктов;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоЗадачиПоДоговору_НаСервере()
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.КоммерческоеВознаграждение.Очистить();
	Если Документ.СуммаДокумента <> 0 Тогда	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДоговорыЗадачиПроекта.ЗадачаПроекта,
			|	ДоговорыЗадачиПроекта.Сумма КАК СуммаОбеспечено		
			|ИЗ
			|	Документ.Договор.ЗадачиПроекта КАК ДоговорыЗадачиПроекта
			|ГДЕ
			|	ДоговорыЗадачиПроекта.Ссылка = &Договор";

		//
		Запрос.УстановитьПараметр("Договор", 	Документ.Договор);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр = Документ.КоммерческоеВознаграждение.Добавить();
			// в расшифровку платежа
			ЗаполнитьЗначенияСвойств( Стр, ВыборкаДетальныеЗаписи );
			
		КонецЦикла;
	КонецЕсли;
	ЗначениеВРеквизитФормы(Документ, "Объект");
	// теперь долю коммерческих расходов по сумме обеспечено
	ЗаполнитьКоммерческиеРасходыПоЗадачам();	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуАктаПоЗадачам()
	
	Если Объект.КоммерческоеВознаграждение.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СуммаДокумента = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивКоэфф = Новый Массив;
	Для Каждого Стр ИЗ Объект.КоммерческоеВознаграждение Цикл
		// всего сумма сметы
		МассивКоэфф.Добавить( Стр.СуммаОбеспечено  );
	КонецЦикла;
	//
	мРез = РаспределитьПропорционально( Объект.СуммаДокумента, МассивКоэфф);
	Для Каждого Стр ИЗ Объект.КоммерческоеВознаграждение Цикл
		Если мРез <> Неопределено Тогда
			Стр.Сумма = мРез[Объект.КоммерческоеВознаграждение.Индекс(Стр)];
		Иначе
			Стр.Сумма = 0;
		КонецЕсли;
	КонецЦикла;
	
	ОстаткиСумм_ПоЗадачам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСумм_ПоЗадачам()
	СуммаПоСмете		= 0;
	СуммаНеНачислено 	= 0;
	СуммаНачислено		= 0;
	СуммаАктов			= 0;
	Для Каждого Стр ИЗ Объект.КоммерческоеВознаграждение Цикл
		// остаток по задаче
		Стр.СуммаНеНачислено	= Стр.СуммаПоСмете 	- Стр.СуммаНачислено - Стр.СуммаВознаграждения;

		СуммаПоСмете 			= СуммаПоСмете 		+ Стр.СуммаПоСмете;
		СуммаНачислено 			= СуммаНачислено 	+ Стр.СуммаНачислено;
		СуммаНеНачислено 		= СуммаНеНачислено 	+ Стр.СуммаНеНачислено;
		СуммаАктов 				= СуммаАктов 		+ Стр.СуммаАктов;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоЗадачиПоДоговору(Команда)
	// состав табличной части Расшифровка платежа
	ЗаполнитьПоЗадачиПоДоговору_НаСервере();
	// начислено ранее
	ЗаполнитьНачисленоРанее_НаСервере();
	//
	РаспределитьСуммуАктаПоЗадачам();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуНачисленияПоЗадачам()
	
	Если Объект.КоммерческоеВознаграждение.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СуммаДокумента = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр ИЗ Объект.КоммерческоеВознаграждение Цикл
		Если Стр.Вручную Тогда
		// ничего не делаем
		
		Иначе
			
		Если Стр.СуммаОбеспечено <> 0 Тогда
				//Стр.СуммаВознаграждения = Стр.Сумма * (Стр.СуммаПоСмете - Стр.СуммаНачислено)/ Стр.СуммаОбеспечено;
				// с учетом предыдущих                  СуммаВознаграждения
				Стр.СуммаВознаграждения = (Стр.Сумма + Стр.СуммаАктов ) * Стр.СуммаПоСмете/ Стр.СуммаОбеспечено - Стр.СуммаНачислено;
			Иначе
				Стр.СуммаВознаграждения = 0;
			КонецЕсли;
		КонецЕсли;
		//
	КонецЦикла;
	
	
	ОстаткиСумм_ПоЗадачам();
	
КонецПроцедуры


&НаКлиенте
Процедура РаспределитьНачислениеПоЗадачам(Команда)
	//
	РаспределитьСуммуАктаПоЗадачам();
    //
	РаспределитьСуммуНачисленияПоЗадачам();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// начилено ранее
	ЗаполнитьНачисленоРанее_НаСервере();
	//
	РаспределитьСуммуНачисленияПоЗадачам();
	//
	ОстаткиСумм_ПоЗадачам();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьНачисленоРанее_НаСервере();
	//
	РаспределитьСуммуНачисленияПоЗадачам();
	//
	ОстаткиСумм_ПоЗадачам();
КонецПроцедуры


&НаКлиенте
Процедура КоммерческоеВознаграждениеПриИзменении(Элемент)
	РаспределитьСуммуНачисленияПоЗадачам();
КонецПроцедуры


&НаКлиенте
Процедура КоммерческоеВознаграждениеСуммаВознагражденияПриИзменении(Элемент)
	Стр =  Элементы.КоммерческоеВознаграждение.ТекущиеДанные;
	Стр.Вручную = Истина;
	
КонецПроцедуры

//Создано по задаче #133079 от 07.09.2018 ГумединАГ
//Заполняет список оплат с суммами, которые они закрыли
&НаСервере
Процедура ЗаполнитьОплатыНаСервере()
	//Получаем все оплаты по договору акта	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оплата.Ссылка КАК Оплата,
		|	ОплатаАктыВыполненныхРабот.Обеспечено КАК Обеспечено,
		|	Оплата.Дата КАК Дата
		|ИЗ
		|	Документ.Оплата КАК Оплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.АктыВыполненныхРабот КАК ОплатаАктыВыполненныхРабот
		|		ПО (ОплатаАктыВыполненныхРабот.Ссылка = Оплата.Ссылка)
		|ГДЕ
		|	Оплата.Договор = &Договор
		|	И Оплата.Проведен = &Проведен
		|	И ОплатаАктыВыполненныхРабот.Акт = &Акт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Запрос.УстановитьПараметр("Акт", Объект.Ссылка);
	Запрос.УстановитьПараметр("Проведен", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЧОплата = Объект.ТаблицаОплата;
	ТЧОплата.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТЧОплатаСтрока = ТЧОплата.Добавить();
		ТЧОплатаСтрока.ДокументОплаты = ВыборкаДетальныеЗаписи.Оплата;
		ТЧОплатаСтрока.Обеспечено = ВыборкаДетальныеЗаписи.Обеспечено;
	КонецЦикла;

КонецПроцедуры

//Создано по задаче #133079 от 07.09.2018 ГумединАГ
&НаКлиенте
Процедура ЗаполнитьОплаты(Команда)
	ЗаполнитьОплатыНаСервере();
КонецПроцедуры
